---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ArchitecturalColumn
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ArchitecturalColumn

Adds architectural columns to the building model.